app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @category = Category.find(params[:id])

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "categories" SET "name" = $1 WHERE "categories"."id" = $2  [["name", "Catégorie de testi"], ["id", 1]]
---
  def update
    @category = Category.find(params[:id])
    @category.update(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 2]]
---
  def destroy
    @category = Category.find(params[:id])
    @category.destroy

INSERT INTO "categories" ("name", "slug") VALUES ($1, $2) RETURNING "id"  [["name", "Catégorie de test"], ["slug", "category-de-test"]]
---
  def create
    category = Category.create(category_params)

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
---
  def edit
    @category = Category.find(params[:id])