app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "posts" SET "name" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["name", "testi"], ["updated_at", "2019-10-23 20:26:11.581155"], ["id", 1]]
---
  def update
    @post = Post.find(params[:id])
    @post.update(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 1]]
---
  def destroy
    @post = Post.find(params[:id])
    @post.destroy()

INSERT INTO "posts" ("name", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test1"], ["content", "cont1"], ["created_at", "2019-10-23 21:06:41.022281"], ["updated_at", "2019-10-23 21:06:41.022281"]]
---
  def create
    @post = Post.create(post_params)